// @strict-types

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ОтображениеСообщенийКлиент.ПоказатьСообщение("Не стоит создавать этот документ вручную");
	
	Хуй = Вычислить("хуй");
	
	СписокКнопок = Новый СписокЗначений(); // СписокЗначений из Строка
	СписокКнопок.ТипЗначения = Новый ОписаниеТипов("Строка");
	СписокКнопок.Добавить("Уверен");
	
	//тут я немного накакал
	
	СписокКнопок.Добавить("Воздержусь");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросРаботатьСДокументом", ЭтотОбъект);
	
	ОтображениеСообщенийКлиент.ЗадатьВопрос("Точно хочешь работать с документом?", СписокКнопок, ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вопрос работать с документом.
// 
// Параметры:
//  РезультатВопроса - Строка - Результат вопроса
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
&НаКлиенте
Процедура ВопросРаботатьСДокументом(РезультатВопроса, ДополнительныеПараметры=Неопределено) Экспорт
	Если РезультатВопроса = "Воздержусь" Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
