// @strict-types

// Показать сообщение.
// 
// Параметры:
//  ТекстСообщения - Строка - Текст сообщения
Процедура ПоказатьСообщение(ТекстСообщения) Экспорт
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры


// Задать вопрос.
// 
// Параметры:
//  ТекстВопроса - Строка - Текст вопроса
//  ДоступныеКнопки - РежимДиалогаВопрос, СписокЗначений из Строка - Доступные кнопки
//  ОписаниеОповещенияОЗавешении - ОписаниеОповещения - Описание оповещения о завешении
Процедура ЗадатьВопрос(ТекстВопроса, ДоступныеКнопки, ОписаниеОповещенияОЗавешении) Экспорт
	ПоказатьВопрос(ОписаниеОповещенияОЗавешении, ТекстВопроса, ДоступныеКнопки);
КонецПроцедуры
